// 模拟后台数据
var menuList = [{
    titles: ['家用电器'],
    content: {
        tabs: ['家电馆', '家电专卖店', '家电服务', '企业采购', '商用电器', '以旧换新'],
        subs: [{
            title: '电视',
            items: ['超薄电视', '全面屏电视', '智能电视', 'OLED电视', '智慧屏', '4k超清电视', '55英寸', '65英寸', '电视配件']
        },{
            title: '空调',
            items: ['空调挂机', '空调柜机', '中央空调', '变频空调', '一级能效', '移动空调', '以旧换新']
        },{
            title: '洗衣机',
            items: ['滚筒洗衣机', '洗烘一体机', '波轮洗衣机', '迷你洗衣机', '烘干机', '洗衣机配件']
        },{
            title: '冰箱',
            items: ['多门', '对开门', '三门', '双门', '冷柜/冰吧', '酒柜', '冰箱配件']
        },{
            title: '厨卫大电',
            items: ['油烟机', '燃气罩', '烟灶套餐']
        },{
            title: '厨房小电',
            items: ['电饭煲', '电烤箱', '电压力锅']
        },{
            title: '生活电器',
            items: ['电风扇', '冷风扇', '空气净化器']
        },{
            title: '个护健康',
            items: ['剃须刀', '电动牙刷', '电吹风']
        },{
            title: '视听影音',
            items: ['家庭影院', 'KTV音响', '迷你音响']
        }]
    }
},{
    titles: ['手机', '运营商', '数码'],
    content: {
        tabs: ['玩3c', '手机频道', '网上营业厅', '配件频道', '智能数码', '影响Club'],
        subs: [{
            title: '手机通讯',
            items: ['手机', '游戏手机', '5G手机', '拍照手机', '全面屏手机', '老人机', '对讲机', '以旧换新', '手机维修']
        },{
            title: '运营商', 
            items: ['合约机', '手机卡', '宽带']
        },{
            title: '手机配件',
            items: ['手机壳', '贴膜', '手机存储卡']
        }]
    }
},{
    titles: ['电脑', '办公'],
    content: {
        tabs: ['玩3c', '电脑办公', '企业采购', 'GAME+'],
        subs: [{
            title: '电脑整机',
            items: ['笔记本', '游戏本', '平板电脑', '台式机', '一体机', '服务站/工作站']
        },{
            title: '电脑配件',
            items: ['显示器', 'CPU', '主板', '显卡', '硬盘']
        },{
            title: '外设产品',
            items: ['鼠标', '键盘', '键鼠套装', '网络仪表仪器']
        }]
    }
},{
    titles: ['家具', '家具', '家装', '餐具'],
    content: {
        // tabs: ['写不动了']
    }
},{
    titles: ['男装', '女装', '童装', '内衣']
},{
    titles: ['美妆', '个护清洁', '宠物']
},{
    titles: ['女鞋', '箱包', '珠宝', '钟表']
},{
    titles: ['男鞋', '运动', '户外']
},{
    titles: ['房产', '汽车', '汽车用品']
},{
    titles: ['母婴', '玩具乐器']
},{
    titles: ['食品', '酒类', '生鲜', '特产']
},{
    titles: ['艺术', '礼品鲜花', '农资绿植']
},{
    titles: ['医药保健', '计生情趣']
},{
    titles: ['图文', '文娱', '教育', '电子书']
},{
    titles: ['机票', '酒店', '旅店', '生活']
},{
    titles: ['理财', '众筹', '白条', '保险']
},{
    titles: ['安装', '维修', '清洗', '二手']
},{
    titles: ['工业品']
}];